---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GuidEnum Properties
GuidEnum Class See Also Send Feedback
---

The GuidEnum type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. |

# See Also

GuidEnum Class

Autodesk.Revit.DB Namespace